## Step-1 : Import Required Packages

In [2]:
import numpy as np                   # Math Operations
import pandas as pd                  # Dataframe Operations
import matplotlib.pyplot as plt      # PLotting
import seaborn as sns                # Plotting

## Step-2 : Create A DataFrame using a list

In [6]:
names = ['Niraj','Kalyan','Python']
age = [20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0   Niraj  20
1  Kalyan  22
2  Python  24

**pd.DataFrame()**

- data=None,
- index: list or array-like
- columns: list or array-like

In [9]:
pd.DataFrame(names,age)

         0
20   Niraj
22  Kalyan
24  Python

## Step-3 : Adding the column names

In [13]:
names = ['Niraj','Kalyan','Python']
age = [20,22,24]
cols = ['Names','Age']
pd.DataFrame(zip(names,age),columns = cols)

    Names  Age
0   Niraj   20
1  Kalyan   22
2  Python   24

## Step-4 : Change Index Names

In [17]:
names = ['Niraj','Kalyan','Python']
age = [20,22,24]
cols = ['Names','Age']
inx = ['A','B','C']
pd.DataFrame(zip(names,age),index = inx, columns = cols)

    Names  Age
A   Niraj   20
B  Kalyan   22
C  Python   24

## Step-5 : Create a empty DataFrame and Update the DataFrame

In [20]:
# Above once we create a DataFrame with values directly
# Now first we will create empty df
# then we will add the values

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

## df['Names']

- If i run the above code
- it will display if any column values are available under names or not
- if the name is not present then ERROR
- Either you are creating a new column
- or you are modifying the column values

In [25]:
df = pd.DataFrame()
df['Names'] = ['Python','SQL','PowerBI']
df['Age'] = [30,32,34]
df

     Names  Age
0   Python   30
1      SQL   32
2  PowerBI   34

In [27]:
df['Age']  # if 'Age' column is there it will show only Age elements else error

0    30
1    32
2    34
Name: Age, dtype: int64

In [29]:
df['Age'] = [40,44,46]       # Age is already there , here we are modifying the elements

In [31]:
df

     Names  Age
0   Python   40
1      SQL   44
2  PowerBI   46

In [35]:
df['City'] = ['Hyd','Blr','Chennai']
df

     Names  Age     City
0   Python   40      Hyd
1      SQL   44      Blr
2  PowerBI   46  Chennai

#### Python is case sensitive : df['Age'], df['age'] are totally different

In [38]:
df['age'] = [100,200,300]
df

     Names  Age     City  age
0   Python   40      Hyd  100
1      SQL   44      Blr  200
2  PowerBI   46  Chennai  300

### Notes:

- Python is case sensitive

- 'Age' and 'age' consider as different

- Updated column values always should be same len of dataframe

- Dont expect NULL like sql if we miss any values

## Step-6 : Drop the column

- labels
- axis : Axis = 0 (Default)
- index
- columns
- inplace : bool = False

In [50]:
df

     Names  Age     City  age
0   Python   40      Hyd  100
1      SQL   44      Blr  200
2  PowerBI   46  Chennai  300

In [52]:
df.drop(2)

    Names  Age City  age
0  Python   40  Hyd  100
1     SQL   44  Blr  200

In [54]:
df.drop([2])

    Names  Age City  age
0  Python   40  Hyd  100
1     SQL   44  Blr  200

In [56]:
df.drop(2, axis = 0)

    Names  Age City  age
0  Python   40  Hyd  100
1     SQL   44  Blr  200

In [58]:
df.drop([0,2] , axis = 0)

  Names  Age City  age
1   SQL   44  Blr  200

In [64]:
df.drop('age', axis = 1)

     Names  Age     City
0   Python   40      Hyd
1      SQL   44      Blr
2  PowerBI   46  Chennai

In [80]:
df.drop(labels = 2)

    Names  Age City  age
0  Python   40  Hyd  100
1     SQL   44  Blr  200

In [84]:
df.drop(columns = ['age'])

     Names  Age     City
0   Python   40      Hyd
1      SQL   44      Blr
2  PowerBI   46  Chennai

In [86]:
df.drop(index = 1)

     Names  Age     City  age
0   Python   40      Hyd  100
2  PowerBI   46  Chennai  300

In [88]:
df

     Names  Age     City  age
0   Python   40      Hyd  100
1      SQL   44      Blr  200
2  PowerBI   46  Chennai  300

In [92]:
df.drop('age',axis = 1,inplace = True)

In [94]:
df

     Names  Age     City
0   Python   40      Hyd
1      SQL   44      Blr
2  PowerBI   46  Chennai